matlib/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>This is the text of ANSYS-Mode's README.org for the matlib/ directory</title>
<!-- 2015-06-28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="H. Dieter Wilhelm" />
</head>
<body>
<div id="content">
<h1 class="title">This is the text of ANSYS-Mode's README.org for the matlib/ directory</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Usage in an APDL file</a></li>
<li><a href="#sec-2">2. Materials defined in ANSYS-Mode's library</a></li>
<li><a href="#sec-3">3. Other material data</a></li>
</ul>
</div>
</div>
<p>
Its text is best read in Emacs' Org mode.
</p>

<p>
Copyright (C) 2006 - 2015  H. Dieter Wilhelm, GPL V3
</p>

<p>
If not indicated otherwise in the file name, material properties are
linear and for room temperature.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Usage in an APDL file</h2>
<div class="outline-text-2" id="text-1">
<p>
Specify the material library to read from:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">/mplib,read,/HOME/uidg1626/a-m/matlib
/mplib,stat !show the material directories
!! which materials are acutally in the material library?
/sys,ls ~/a-m/matlib
</pre>
</div>

<p>
You have to indicate the unit system.
</p>

<ul class="org-ul">
<li>SI — International system (m, kg, s, K).
</li>
<li>MKS — MKS system (m, kg, s, °C).
</li>
<li>uMKS — μMKS system (μm, kg, s, °C).
</li>
<li>CGS — CGS system (cm, g, s, °C).
</li>
<li>MPA — MPA system (mm, Mg, s, °C).
</li>
<li>BFT — U. S. Customary system using feet (ft, slug, s, °F).
</li>
<li>BIN — U. S. Customary system using inches (in, lbf*s2/in, s, °F).
</li>
</ul>

<p>
For example:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">/units,mpa !indicate MPA system for subsequent material definitions
mpread,St37,,,lib
</pre>
</div>

<p>
The following block is writing a material definition into the
library.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">/mplib,write,/HOME/uidg1626/a-m/matlib
!! --- It is advisable to make the material files which are commented read only!
/units,mpa !default extension for mpread/write is now MPA_MPL
mat,Steel ! set the appropriate material number
mpwrite
mplist ! Check
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Materials defined in ANSYS-Mode's library</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>42CrMo4_biso_Rp850.MPA_MPL</dt><dd></dd>
<dt>AlSi9Cu3_biso.MPA_MPL</dt><dd></dd>
<dt>C75s_hardened_kinh.MPA_MPL</dt><dd></dd>
<dt>construction_steel.MPA_MPL</dt><dd></dd>
<dt>copper.MPA_MPL</dt><dd></dd>
<dt>M250-35A_aniso.MPA_MPL</dt><dd></dd>
<dt>M250-35A_biso.MPA_MPL</dt><dd></dd>
<dt>M250-35A_orthotropic_elastic.MPA_MPL</dt><dd></dd>
<dt>M800-65A_biso.MPA_MPL</dt><dd></dd>
<dt>NdFeB_magnet.MPA_MPL</dt><dd></dd>
<dt>PPS_Fortron1140L4_70degC_kinh.MPA_MPL</dt><dd></dd>
<dt>PPS.MPA_MPL</dt><dd>Celanese Fortron 1140L4 40 % glass fibre, Young's
modulus 80 % reduced compared to test specimen to
replicate a random fibre orientation.
</dd>
<dt>St37_elastic.MPA_MPL</dt><dd></dd>
<dt>St37.MPA_MPL</dt><dd></dd>
<dt>St70_biso.MPA_MPL</dt><dd></dd>
<dt>X46Cr13.MPA_MPL</dt><dd></dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Other material data</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt>creep_curves_PPS_Fortron1140l4_120degC.csv</dt><dd>A 40 % short glas
fibre filled PPS.  The stress - creep strain curves are scaled
with a factor of 0.8 from test specimen to account for a random
fibre orientation in thick walled parts.  They might be used as
an example for data fitting with the TBFT command.
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: H. Dieter Wilhelm (<a href="mailto:dieter@duenenhof-wilhelm.de">dieter@duenenhof-wilhelm.de</a>)</p>
<p class="date">Modification date: 2015-06-28 </p>
<p class="creator">Generated by Emacs 24.5.1 (Org mode 8.2.10) </p>
</div>
</body>
</html>

